<%@ page language="java" contentType="text/html; charset=UTF-8"
	pageEncoding="UTF-8"%>
<%
	String privacyPolicy = "개인정보취급(처리)방침\n\n" +
	    "'Trip Table 주식회사'(이하 '회사'라 합니다)는 이용자의 개인정보를 중요시하며, 「정보통신망 이용촉진 및 정보보호에 관한 법률」, 개인정보보호법」을 준수하기 위하여 노력하고 있습니다.\n\n" +
	    "회사는 개인정보취급(처리)방침을 통하여 회사가 이용자로부터 제공받은 개인정보를 어떠한 용도와 방식으로 이용하고 있으며, 개인정보보호를 위해 어떠한 조치를 취하고 있는지 알려드립니다.\n\n" +
	    "본 방침은 2024년 1월 25일부터 시행되며, 이를 개정하는 경우 웹사이트 공지사항(또는 개별공지)을 통하여 공지하겠습니다.\n\n" +
	    "\n" +
	    "0. 총칙\n" +
	    "\n" +
	    "“개인정보”란 생존하는 개인에 관한 정보로서 당해 정보에 포함되어 있는 성명, 주민등록번호 등의 사항에 의하여 당해 개인을 식별할 수 있는 정보(당해 정보만으로는 특정 개인을 식별할 수 없더라도 다른 정보와 용이하게 결합하여 식별할 수 있는 것을 포함)를 말합니다.\n" +
	    "\n" +
	    "회사는 이용자의 개인정보보호를 매우 중요시하며, 「정보통신망 이용촉진 및 정보보호 등에 관한 법률」, 「개인정보보호법」 및 행정안전부가 제정한 '개인정보보호지침' 등을 준수하고 있습니다.\n" +
	    "\n" +
	    "회사는 본 개인정보취급(처리)방침을 통하여 이용자께서 제공하시는 개인정보가 어떠한 용도의 방식으로 이용되고 있으며 개인정보보호를 위해 어떠한 조치가 취해지고 있는지 알려 드립니다.\n" +
	    "\n" +
	    "회사는 본 개인정보취급(처리)방침을 G-SRM Supplier Portal 홈페이지(http://www.secbuy.com)의 첫 화면에 공개함으로써 이용자께서 언제나 용이하게 보실 수 있도록 조치하고 있습니다.\n" +
	    "\n" +
	    "회사는 개인정보취급(처리)방침의 지속적인 개선을 위하여 개인정보취급(처리)방침을 개정하는데 필요한 절차를 정하고 있습니다. 그리고 개인정보취급(처리)방침을 개정하는 경우 버전번호 등을 부여하여 개정된 사항을 쉽게 알아볼 수 있도록 하고 있습니다.\n" +
	    "\n" +
	    "1. 수집하는 개인정보의 항목 및 수집방법\n\n" +
	    "(1) 수집하는 개인정보의 항목\n\n" +
	    "회사는 최초 회원 가입 또는 서비스 이용 시 이용자로부터 아래와 같은 개인정보를 수집하고 있습니다.\n\n" +
	    "□ 필수항목\n※ 귀하께서는 필수항목 수집ㆍ이용에 대한 동의를 거부하실 수 있으나, 이는 서비스 제공에 필수적으로 제공되어야 하는 정보이므로, 동의를 거부하실 경우 회원 가입, 서비스 이용, 홈페이지 이용 등을 하실 수 없습니다.\n\n" +
	    "○ 회원가입을 위해 필요한 업체코드, 업체명, 업체명(영문), 로그인ID, 비밀번호, 이름, 영문이름, 위치(국가코드), 언어, 전화번호, E-mail, 승인신청시스템, 2차협력사구분, 2차협력사명\n\n" +
	    "□ 선택항목\n※ 귀하께서는 선택항목 수집ㆍ이용에 대한 동의를 거부하실 수 있으며, 이는 서비스 제공에 필수적으로 제공되어야 하는 정보가 아니므로, 동의를 거부하시더라도 회원 가입, 서비스 이용, 홈페이지 이용 등이 가능합니다. 서비스 이용과정에서 선택항목 수집, 이용이 필요할 경우 별도로 안내하고 동의 받도록 하겠습니다.\n\n" +
	    "○ 휴대폰번호, 팩스번호, 업무\n※ 회사는 이용자의 사생활을 현저히 침해할 우려가 민감정보(사상ㆍ신념, 노동조합ㆍ정당의 가입ㆍ탈퇴, 정치적 견해, 건강, 성생활 등에 관한 정보 등)는 수집하지 않습니다. ※ 회사는 원칙적으로 이용자가 만 14세 미만자일 경우 개인정보를 수집하지 않습니다. 부득이 서비스 이용을 위하여 만 14세 미만자의 개인정보를 수집할 때에는, 사전에 법정대리인의 동의를 구하고 관련 업무가 종료됨과 동시에 정보를 지체 없이 파기토록 하겠으며 업무가 진행되는 동안 개인정보를 철저히 관리토록 하겠습니다.\n\n" +
	    "(2) 개인정보 수집방법\n\n- 홈페이지, 멤버쉽 가입\n※ 회사는 이용자께서 회사의 개인정보 수집ㆍ이용 동의서 각각의 내용에 대해 '동의' 또는 '동의하지 않음'을 선택할 수 있는 절차를 마련하고 있습니다.\n\n" +
	    "2. 개인정보의 수집 및 이용목적\n\n□ 회사는 수집한 개인정보를 다음의 목적을 위해 활용합니다.\n" +
	    "○ 회원관리 및 본인확인\n- 개인정보 처리 및 정보주체의 개인정보 열람, 정정, 삭제 요구시 본인 확인을 위함\n- 삼성전자 구매담당자가 공지사항 및 메일 전송을 하기 위함.\n" +
	    		"3. 개인정보의 보유 및 이용기간\n\n" +
	    	    "원칙적으로, 개인정보 수집 및 이용목적이 달성된 후에는 해당 정보를 지체 없이 파기합니다.\n" +
	    	    "단, 관계법령의 규정에 의하여 보존할 필요가 있는 경우 회사는 아래와 같이 관계법령에서 정한 일정한 기간 동안 회원정보를 보관합니다. 이 경우 회사는 해당 개인정보를 별도의 데이터베이스(DB)로 옮기거나 보관장소를 달리하여 보존합니다.\n\n" +
	    	    "- 계약 또는 청약철회 등에 관련 기록: 5년 (전자상거래 등에서의 소비자보호에 관한 법률)\n" +
	    	    "- 대금결제 및 재화 등의 공급에 관한 기록: 5년 (전자상거래 등에서의 소비자보호에 관한 법률)\n" +
	    	    "- 소비자의 불만 또는 분쟁처리에 관한 기록: 3년 (전자상거래 등에서의 소비자보호에 관한 법률)\n" +
	    	    "- 신용정보의 수집/처리 및 이용 등에 관한 기록: 3년 (신용정보의 이용 및 보호에 관한 법률)\n" +
	    	    "- 표시/광고에 관한 기록: 6개월 (전자상거래 등에서의 소비자보호에 관한 법률)\n" +
	    	    "- 이용자의 인터넷 등 로그기록/이용자의 접속지 추적자료: 3개월 (통신비밀보호법)\n" +
	    	    "- 그 외의 통신사실 확인자료: 6개월 (통신비밀보호법)\n\n" +
	    	    "4. 개인정보의 파기 절차 및 파기방법\n\n" +
	    	    "회사는 원칙적으로 개인정보 수집 및 이용목적이 달성된 후에는 해당 정보를 지체 없이 파기합니다. 파기절차 및 방법은 다음과 같습니다.\n\n" +
	    	    "(1) 파기절차\n" +
	    	    "이용자의 개인정보는 목적이 달성된 후 별도의 DB로 옮겨져(종이의 경우 별도의 서류함) 내부 방침 및 기타 관련 법령에 의한 정보보호 사유에 따라(보유 및 이용기간 참조) 일정 기간 저장된 후 파기됩니다. 별도 DB로 옮겨진 개인정보는 법률에 의한 경우가 아니고서는 보유되는 이외의 다른 목적으로 이용되지 않습니다.\n\n" +
	    	    "(2) 파기방법\n" +
	    	    "전자적 파일형태로 저장된 개인정보는 기록을 재생할 수 없는 기술적 방법을 사용하여 삭제합니다.\n" +
	    	    "종이에 출력된 개인정보는 분쇄기로 분쇄하거나 소각을 통하여 파기합니다.\n\n" +
	    	    "5. 수집한 개인정보의 위탁\n\n" +
	    	    "회사는 서비스 이행을 위해 아래와 같이 개인정보 처리 업무를 외부 전문업체에 위탁하여 처리하고 있습니다. 개인정보 처리위탁은 개별 서비스 별로 그 이행을 위해 필요한 경우에 한해 각 위탁업체에 대해 이루어집니다.\n\n" +
	    	    "개인정보의 처리를 위탁하는 경우에는 개인정보 보호의 안전을 기하기 위하여 개인정보보호 관련 지시엄수, 개인정보에 대한 비밀유지, 제3자 제공의 금지 및 사고시의 책임부담, 위탁기간, 처리 종료 후의 개인정보의 반환 또는 파기 등을 명확히 규정하고, 위탁업체가 개인정보를 안전하게 처리하도록 감독합니다.\n\n" +
	    	    "○ 수탁업체의 명칭: 삼성에스디에스㈜ 및 오픈타이드코리아㈜\n" +
	    	    "○ 위탁하는 업무의 내용: 회원관리 서비스 이용에 따른 본인확인, 고지사항 전달, 웹사이트 및 시스템 관리, 문의 등 각종 고객 민원 처리\n\n" +
	    	    "6. 제3자에게의 개인정보 제공\n\n" +
	    	    "회사는 이용자의 개인정보를 원칙적으로 외부에 제공하지 않습니다. 다만, 아래의 경우에는 예외로 합니다.\n\n" +
	    	    "- 법령의 규정에 의거하거나, 수사 목적으로 법령에 정해진 절차와 방법에 따라 수사기관의 요구가 있는 경우\n" +
	    	    "- 유료 서비스 제공에 따른 요금 정산을 위하여 필요한 경우\n" +
	    	    "- 통계작성, 학술연구나 시장조사를 위해 특정 개인을 식별할 수 없는 형태로 가공하여 제공하는 경우\n" +
	    	    "- 이용자들이 사전에 동의한 경우\n\n" +
	    	    "※이상에 기재된 업체는 추후 변동될 수 있습니다. 업체가 변경되거나, 또는 기재된 내용 외에 이용자의 개인정보를 제공하거나 공유하는 경우에는 이에 대한 별도 이용자 동의를 구하는 절차를 거쳐 제공합니다.\n\n" +
	    	    "7. 이용자 및 법정대리인의 권리와 그 행사방법\n\n" +
	    	    "이용자 및 법정대리인은 등록되어 있는 이용자 본인 혹은 당해 만 14세 미만자의 개인정보 관련하여, 언제든지 개인정보 열람/ 정정,삭제/ 처리정지/ 동의 철회를 요청할 수 있습니다.\n\n" +
	    	    "이를 위하여 홈페이지의 “개인정보변경”(또는 “회원정보수정” 등) 메뉴를 이용하시거나, 대표전화(1588-3366) 또는 개인정보 관리책임자에게 서면, 전화 또는 이메일로 연락하시면 지체없이 조치하겠습니다.\n\n" +
	    	    "회사는 다음에 해당하는 경우에는 개인정보의 전부 또는 일부에 대하여 열람/ 정정,삭제를 거절할 수 있습니다.\n" +
	    	    "　- 법률에 따라 열람이 금지되거나 제한되는 경우\n" +
	    	    "　- 다른 사람의 생명ㆍ신체를 해할 우려가 있거나 다른 사람의 재산과 그 밖의 이익을 부당하게 침해할 우려가 있는 경우\n\n" +
	    	    "2. 이용자가 개인정보의 오류에 대한 정정을 요청하신 경우에는 정정을 완료하기 전까지 당해 개인정보를 이용 또는 제3자에게 제공하지 않습니다. 또한 잘못된 개인정보를 제3자에게 이미 제공한 경우에는 정정 처리결과를 제3자에게 지체 없이 통지하겠습니다.\n\n" +
	    	    "회사는 이용자 혹은 법정대리인의 요청에 의해 삭제/ 처리 정지된 개인정보는 “3. 개인정보의 보유 및 이용기간”에 명시된 바에 따라 처리하고 그 외의 용도로 열람 또는 이용할 수 없도록 처리하고 있습니다.\n\n" +
	    	    "이용자의 개인정보를 최신의 상태로 정확하게 입력하여 주시기 바랍니다. 이용자가 입력한 부정확한 정보로 인해 발생\n" +
				"8. 개인정보 자동수집 장치의 설치, 운영 및 그 거부에 관한 사항\n"+
				"\n회사는 이용자의 정보를 수시로 저장하고 찾아내는 ‘쿠키(cookie)’ 등을 운용합니다. 쿠키란 회사의 웹사이트를 운영하는데 이용되는 서버가 이용자의 브라우저에 보내는 아주 작은 텍스트 파일로, 이용자의 컴퓨터 하드디스크에 저장됩니다.\n" +
				"\n(1) 쿠키 등 사용 목적 \n: 자동로그인 기능 구현, 회원과 비회원의 접속 빈도나 방문 시간 등을 분석, 이용자의 취향과 관심분야를 파악 및 자취 추적, 각종 이벤트 참여 정도 및 방문 회수 파악 등을 통한 타겟 마케팅 및 개인 맞춤 서비스 제공\n"+
				"\n(2) 쿠키 설정 거부 방법 \n\n이용자는 쿠키 설치에 대한 선택권을 가지고 있습니다. 따라서 웹브라우저에서 옵션을 설정함으로써 모든 쿠키를 허용하거나, 쿠키가 저장될 때마다 확인을 거치거나, 아니면 모든 쿠키의 저장을 거부할 수도 있습니다.\n" + 
				"단, 이용자께서 쿠키 설치를 거부하였을 경우 서비스 제공에 어려움이 있을 수 있습니다.\n\n- 쿠키설정 방법 (인터넷 익스플로러8.0을 사용하고 있는 경우)\n: 「도구」메뉴에서「인터넷옵션」을 선택합니다.「개인정보 탭」을 클릭합니다.\n" + 
				"「설정」을 이용하여 본인에게 맞는 쿠키허용 수준을 설정하시면 됩니다.\n- 받은 쿠키를 보는 방법 (익스플로러8.0을 사용하고 있는 경우)\n: 「도구」 메뉴에서 「인터넷옵션」 을 선택합니다.\n「일반」 탭을 클릭하여 ‘검색기록’ 의 「설정」 으로 들어가서, 「파일보기」 를 통해 확인합니다.\n" + 
				"- 쿠키 설정 거부 방법 (인터넷 익스플로어 8.0 사용하고 있는 경우)\n: 「도구」 메뉴에서 「인터넷옵션」 을 선택합니다. 「개인정보 탭」 을 클릭합니다.\n「설정」 을 이용하여 상위레벨로 하여 “모든 쿠키차단”으로 설정하시면 됩니다."+
				"9. 기타 개인정보 취급에 관한 방침"+
				"(1) 개인정보 보호를 위한 기술적, 관리적 조치\n\n" +
				 "회사는 이용자의 개인정보를 취급함에 있어 개인정보가 분실, 도난, 누출, 변조 또는 훼손되지 않도록 안전성 확보를 위하여 다음과 같은 기술적, 관리적 조치를 강구하고 있습니다.\n\n"
				+ "- 내부관리계획의 수립 및 시행\n"
				+ "ㆍ회사는 개인정보의 안전한 처리를 위하여 내부관리계획을 수립하고 시행하고 있습니다.\n"
				+ "ㆍ회사는 사내 개인정보보호 전담기구 등을 통해 개인정보보호조치의 이행사항 및 담당자의 준수여부를 확인하여 문제 발견 시 즉시 시정 조치하도록 하고 있습니다.\n\n"
				+ "- 접근통제장치의 설치 및 운영\n"
				+ "ㆍ회사는 침입차단시스템을 이용하여 외부로부터 무단 접근을 통제하고 있으며, 기타 시스템적으로 보안성을 확보하기 위하여 가능한 모든 기술적 장치를 갖추려 노력하고 있습니다.\n\n"
				+ "- 접속기록의 위조, 변조 방지를 위한 조치\n"
				+ "ㆍ회사는 개인정보처리시스템에 접속한 기록을 보관, 관리하고 있으며, 접속기록이 위조, 변조되지 않도록 보안기능을 사용하고 있습니다.\n\n"
				+ "- 개인정보의 암호화\n"
				+ "ㆍ이용자의 개인정보는 비밀번호에 의해 보호되며, 파일 및 전송 데이터를 암호화하거나 파일 잠금기능(Lock)을 사용하여 저장, 관리되며, 중요한 데이터는 별도의 보안기능을 통해 보호되고 있습니다.\n\n"
				+ "- 해킹 등에 대비한 대책\n"
				+ "ㆍ회사는 백신프로그램을 이용하여 컴퓨터바이러스에 의한 피해를 방지하기 위한 조치를 취하고 있습니다. 백신프로그램은 주기적으로 업데이트되며 갑작스런 바이러스가 출현할 경우 백신이 나오는 즉시 이를 제공함으로써 개인 정보가 침해되는 것을 방지하고 있습니다.\n"
				+ "ㆍ회사는 암호알고리즘을 이용하여 네트워크 상의 개인정보를 안전하게 전송할 수 있는 보안장치(SSL)를 채택하고 있습니다.\n"
				+ "ㆍ해킹 등 외부침입에 대비하여 각 서버마다 침입차단시스템 및 취약점 분석 시스템 등을 이용하여 보안에 만전을 기하고 있습니다.\n"
				+ "ㆍ개인정보와 일반 데이터를 혼합하여 보관하지 않고 별도의 서버를 통해 분리하여 보관하고 있습니다.\n\n"
				+ "- 취급 직원의 최소화 및 교육\n"
				+ "ㆍ회사는 이용자의 개인정보에 대한 접근권한을 이용자를 직접 상대로 하여 마케팅 업무를 수행하는 자, 개인정보관리책임자 및 담당자 등 개인정보관리업무를 수행하는 자, 기타 업무상 개인정보의 취급이 불가피한 자로 제한 하고 있습니다.\n"
				+ "ㆍ개인정보를 취급하는 직원을 대상으로 새로운 보안 기술 습득 및 개인정보 보호 의무 등에 관해 정기적인 사내 교육 및 외부 위탁교육을 실시하고 있습니다.\n"
				+ "ㆍ입사시 전 직원의 보안서약서를 통하여 사람에 의한 정보유출을 사전에 방지하고 개인정보보호정책에 대한 이행사항 및 직원의 준수여부를 감사하기 위한 내부절차를 마련하고 있습니다.\n"
				+ "ㆍ개인정보 관련 취급자의 업무 인수인계는 보안이 유지된 상태에서 철저하게 이뤄지고 있으며 입사 및 퇴사후 개인정보 사고에 대한 책임을 명확화하고 있습니다.\n"
				+ "ㆍ전산실 및 자료 보관실 등을 특별 보호구역으로 설정하여 출입을 통제하고 있습니다.\n\n"
				+ "(2) 링크사이트 제공 방침\n\n"
				+"회사는 이용자에게 다른 회사의 웹사이트 또는 자료에 대한 링크를 제공할 수 있으며, 삼성서비스를 통해 제3자가 개발한 제품 및 서비스를 사용할 수 있습니다(예를 들어, 삼성앱스를 통해 제3자가 개발한 어플리케이션을 다운로드 받아 사용하는 경우 등).\n"
				+ "이 경우 회사는 제3자의 사이트, 자료, 제품 및 서비스에 대한 아무런 통제권이 없으므로 그로부터 제공받는 제품 및 서비스나 자료의 유용성에 대해 책임질 수 없으며 보증할 수 없습니다. 회사가 포함하고 있는 링크를 클릭(click)하여 타 사이트(site)의 페이지로 옮겨갈 경우 해당 사이트의 개인정보보호정책은 회사와 무관하므로 새로 방문한 사이트의 정책을 검토해 보시기 바랍니다.\n\n"
				+ "(3) 게시물 운영 방침\n\n"
				+ "회사는 이용자의 게시물을 소중하게 생각하며 변조, 훼손, 삭제되지 않도록 최선을 다하여 보호합니다. 그러나 다음의 경우는 그렇지 아니합니다.\n\n"
				+ "- 스팸(spam)성 게시물\n"
				+ "- 타인을 비방할 목적으로 허위 사실을 유포하여 타인의 명예를 훼손하는 게시물\n"
				+ "- 동의 없는 타인의 신상공개 게시물\n"
				+ "- 회사 또는 제3자의 지적재산권 등 권리를 침해하는 내용의 게시물\n"
				+ "- 기타 게시판 주제와 다른 내용의 게시물\n"
				+ "회사는 바람직한 게시판 문화를 활성화하기 위하여 동의 없는 타인의 신상 공개시 특정 부분을 삭제하거나 기호 등으로 수정하여 게시할 수 있으며, 다른 주제의 게시판으로 이동 가능한 내용일 경우 해당 게시물에 이동 경로를 밝혀 오해가 없도록 하고 있습니다.\n\n"
				+ "그 외의 경우 명시적 또는 개별적인 경고 후 삭제 조치할 수 있습니다.\n\n"
				+ "근본적으로 게시물에 관련된 제반 권리와 책임은 작성자 개인에게 있습니다. 또 게시물을 통해 자발적으로 공개된 정보는 보호받기 어려우므로 정보 공개 전에 심사 숙고하시기 바랍니다.\n\n"
				+ "(4) 이메일 무단수집 거부 방침\n\n"
				+ "회사는 게시된 이메일 주소가 전자우편 수집 프로그램이나 그 밖의 기술적 장치를 이용하여 무단 수집되는 것을 거부합니다. 이를 위반 시 「정보통신망 이용촉진 및 정보보호 등에 관한 법률」등에 의해 처벌 받을 수 있습니다.\n\n"
				+ "(5) 광고성 정보의 전송\n\n"
				+ "회사는 이용자의 명시적인 수신거부의사에 반하여 영리목적의 광고성 정보를 전송하지 않습니다.\n\n"
				+ "회사는 이용자가 상품정보 안내, 뉴스레터 등 이메일 전송에 대한 동의를 한 경우, 이메일 제목란 및 본문란에 다음 사항과 같이 이용자가 쉽게 알아 볼 수 있도록 조치합니다.\n"
				+ "- 이메일 제목란에는 광고라는 문구를 표시하지 않을 수 있으며 이메일 본문란의 주요 내용을 표시합니다.\n"
				+ "- 이메일 본문란에는 이용자가 수신거부의 의사표시를 할 수 있는 전송자의 명칭, 이메일 주소 및 전화번호를 명시하고, 이용자가 수신 거부의 의사를 쉽게 표시할 수 있는 방법을 명시합니다.\n\n"
				+ "팩스ㆍ휴대폰 문자전송 등 이메일 이외의 매체를 통해 영리목적의 광고성 정보를 전송하는 경우 관련 법령에 따라 전송내용 처음에 “광고” 문구를 표기하는 등 필요한 조치를 행합니다."
				+ "10. 개인정보 관리책임자 및 고객서비스 담당부서 등 안내\n\n"
				+ "회사는 이용자의 개인정보를 보호하고 개인정보와 관련한 불만을 처리하기 위하여 아래와 같이 관련 부서 및 개인정보관리책임자를 지정하고 있습니다.\n\n"
				+ "(1) 개인정보 보호담당자\n\n"
				+ "ㆍ성명 : 손수빈 팀장\n"
				+ "ㆍ소속 : Trip Table\n"
				+ "ㆍ전화 : 010-5096-0928\n\n"
				+ "(2) 개인정보 관리책임자\n\n"
				+ "ㆍ성명 : 임상모 전무\n"
				+ "ㆍ소속 : 개인정보보호사무국\n"
				+ "ㆍ전화: 1588-4730\n"
				+ "ㆍ문의처: privacy.sec@samsung.com\n"
				+ "※ 개인정보 보호 담당부서로 연결됩니다.\n\n"
				+ "(3) 기타 기관\n\n"
				+ "이용자는 회사의 서비스를 이용하며 발생하는 모든 개인정보보호 관련 민원을 개인정보관리책임자 혹은 담당부서로 신고하실 수 있습니다.\n"
				+ "회사는 이용자들의 신고사항에 대해 신속하게 충분한 답변을 드릴 것입니다.\n\n"
				+ "- 개인정보침해신고센터 (www.118.or.kr/ 118)\n"
				+ "- 대검찰청 인터넷범죄수사센터 (www.spo.go.kr / 02-3480-3600)\n";


%>
<!DOCTYPE html>
<html lang="ko">
<head>
<meta charset="utf-8" />
<meta name="viewport"
	content="width=device-width, initial-scale=1, shrink-to-fit=no" />
<meta name="description" content="" />
<meta name="author" content="" />
<title>Trip Table Login</title>
<!-- Favicon-->
<link rel="icon" type="image/x-icon" href="../img/LogoRaccoon.png" />
<!-- Bootstrap icons-->
<link
	href="https://cdn.jsdelivr.net/npm/bootstrap-icons@1.5.0/font/bootstrap-icons.css"
	rel="stylesheet" />
<link
	href="https://cdn.jsdelivr.net/npm/bootstrap@5.3.2/dist/css/bootstrap.min.css"
	rel="stylesheet">
<script
	src="https://cdn.jsdelivr.net/npm/bootstrap@5.3.2/dist/js/bootstrap.bundle.min.js"></script>
<script src="https://cdn.jsdelivr.net/npm/axios/dist/axios.min.js"></script>
<!-- Core theme CSS (includes Bootstrap)-->
<link href="css/styles.css" rel="stylesheet" />
<link href="../css/font.css" rel="stylesheet" />
<style>
a {
	text-decoration: none;
}

.card {
	border: none;
	width: 400px;
}

h3 {
	color: #007BFF; /* 파란색 글자 색상 */
}

#container {
	display: flex;
	align-items: center;
	justify-content: center;
	flex: 1;
	flex-direction: column;
}

.form-group:nth-of-type(2) {
	margin-top: 10px;
}

.Btn-login {
	margin-top: 30px;
	width: 100%;
	height: 55px;
}

.btn-group {
	padding: 16px;
}

.btn-type {
	border-radius: 0;
	border: 1px solid rgba(0, 0, 0, 0.3);
	opacity: 0.5;
}

.btn-type.active {
	opacity: 1;
	border-top: 2px solid blue;
	border-bottom: 0;
	border-left: 1px solid rgba(0, 0, 0, 0.3);
	border-right: 1px solid rgba(0, 0, 0, 0.3);
}
</style>
</head>
<body class="d-flex flex-column h-100">
	<div class="container" id="container">
		<div class="card-header mb-4">
          <a href="index.do">
            <span style="transform:translate3d(0,0,0);vertical-align:middle;-webkit-font-smoothing:antialiased;-moz-osx-font-smoothing:grayscale;width:auto;height:auto" class="logo-image">
              <img src="../img/LogoRaccoon.png" alt="로고너구리" style="width: 30px; display: inline-block;" />
              <img src="../img/Logo2.png" alt="로고" style="height: 32px; display: inline-block;" />
            </span>
          </a>
      </div>
		<div class="p-5 py-4 pb-5 border shadow">
			<div class="w-100">

				<div class="card mt-3" id="userLogin">
					<div class="container" style="margin-top: 17px" width="400px">
						<div class="container" style="margin: auto; height:350px; width: 388px; text-align: center">
							<h3>TripTable을 바로 시작해보세요</h3>
							<div class="mb-3 mt-4">
								<div style="display: flex; justify-content: center;">
									<div class="form-group">
										<form action="/user/joinForm.do">
											<div style="width: 400px">

													<textarea class="form-control" rows="4" style="height:170px"><%=privacyPolicy %></textarea>

												<div class="form-group form-check flex flex-col" style="text-align:left;">
													<label class="form-check-label my-3"> <input
														class="form-check-input" type="checkbox" name="remember"
														required> [필수] TripTable 서비스 이용 약관
													</label>

												</div>
											</div>
											<br />
											<button type="submit" class="btn btn-primary">동의합니다</button>
										</form>

									</div>

								</div>


							</div>
						</div>
					</div>

					<div class="card mt-3" id="adminLogin" style="display: none;">
						<div class="btn-group w-100" role="group" aria-label="User Type">
							<button type="button" class="btn btn-type active userBtn">User</button>
							<button type="button" class="btn btn-type adminBtn">Admin</button>
						</div>
						<div class="card-body">
							<form>
								<div class="form-group">
									<label for="adminUsername">아이디</label> <input type="text"
										class="form-control" id="adminUsername"
										placeholder="아이디를 입력해주세요.">
								</div>
								<div class="form-group">
									<label for="adminPassword">비밀번호</label> <input type="password"
										class="form-control" id="adminPassword"
										placeholder="비밀번호를 입력해주세요.">
								</div>
								<button type="button" class="btn btn-primary Btn-login">
									<a href="./index.html" class="text-white">Log in</a>
								</button>
							</form>
						</div>
					</div>

				</div>
			</div>
		</div>
	</div>

	<!-- Bootstrap core JS-->
	<!-- 부트스트랩 JS 종속성 (jQuery 및 Popper.js) -->
	<script src="https://code.jquery.com/jquery-3.6.0.slim.min.js"></script>
	<script
		src="https://cdn.jsdelivr.net/npm/@popperjs/core@2.11.6/dist/umd/popper.min.js"></script>
	<!-- 부트스트랩 JS -->
	<script
		src="https://cdn.jsdelivr.net/npm/bootstrap@5.3.0/dist/js/bootstrap.min.js"></script>

	<!-- Core theme JS-->
	<script src="https://code.jquery.com/jquery-3.6.4.min.js"
		integrity="sha384-oR2wazi8sOb8b2ZUpSZlG60SQIDevzvsy3WlA+cxsn5BE5lssNHDN9oAWD+1bz1g"
		crossorigin="anonymous"></script>
	<script src="js/scripts.js"></script>
</body>
</html>
